###################################################################

# Created by write_sdc on Wed Dec 25 06:25:18 2024

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_capacitance 0.25 [current_design]
set_max_fanout 15 [current_design]
set_max_transition 2.4 [current_design]
set_load -pin_load 15 [get_ports hfxoscen]
set_load -pin_load 15 [get_ports lfxoscen]
set_load -pin_load 15 [get_ports io_pads_jtag_TDO_o]
set_load -pin_load 15 [get_ports io_pads_qspi0_sck_o_oval]
set_load -pin_load 15 [get_ports io_pads_qspi0_cs_0_o_oval]
set_load -pin_load 15 [get_ports io_pads_aon_pmu_padrst_o_oval]
set_load -pin_load 15 [get_ports io_pads_aon_pmu_vddpaden_o_oval]
create_clock [get_ports hfextclk]  -period 50  -waveform {0 25}
set_clock_latency 4  [get_clocks hfextclk]
set_clock_latency -source 2  [get_clocks hfextclk]
set_clock_uncertainty 0.5  [get_clocks hfextclk]
set_clock_transition -max -rise 1 [get_clocks hfextclk]
set_clock_transition -max -fall 1 [get_clocks hfextclk]
set_clock_transition -min -rise 1 [get_clocks hfextclk]
set_clock_transition -min -fall 1 [get_clocks hfextclk]
create_clock [get_ports lfextclk]  -period 20000  -waveform {0 10000}
set_clock_latency 4  [get_clocks lfextclk]
set_clock_latency -source 2  [get_clocks lfextclk]
set_clock_uncertainty 0.5  [get_clocks lfextclk]
set_clock_transition -max -rise 1 [get_clocks lfextclk]
set_clock_transition -max -fall 1 [get_clocks lfextclk]
set_clock_transition -min -rise 1 [get_clocks lfextclk]
set_clock_transition -min -fall 1 [get_clocks lfextclk]
create_clock [get_ports io_pads_jtag_TCK_i_ival]  -name JTAG_CLK  -period 1000  -waveform {0 500}
set_clock_latency 4  [get_clocks JTAG_CLK]
set_clock_latency -source 2  [get_clocks JTAG_CLK]
set_clock_uncertainty 0.5  [get_clocks JTAG_CLK]
set_clock_transition -max -rise 1 [get_clocks JTAG_CLK]
set_clock_transition -max -fall 1 [get_clocks JTAG_CLK]
set_clock_transition -min -rise 1 [get_clocks JTAG_CLK]
set_clock_transition -min -fall 1 [get_clocks JTAG_CLK]
create_clock [get_ports io_pads_aon_erst_n_i_ival]  -name rst_n  -period 36000  -waveform {460 35540}
set_clock_latency 4  [get_clocks rst_n]
set_clock_latency -source 2  [get_clocks rst_n]
set_clock_uncertainty 0.5  [get_clocks rst_n]
set_clock_transition -max -rise 1 [get_clocks rst_n]
set_clock_transition -max -fall 1 [get_clocks rst_n]
set_clock_transition -min -rise 1 [get_clocks rst_n]
set_clock_transition -min -fall 1 [get_clocks rst_n]
set_input_delay -clock JTAG_CLK  3  [get_ports io_pads_jtag_TMS_i_ival]
set_input_delay -clock JTAG_CLK  3  [get_ports io_pads_jtag_TDI_i_ival]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioA[31]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioA[30]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioA[29]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioA[28]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioA[27]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioA[26]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioA[25]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioA[24]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioA[23]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioA[22]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioA[21]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioA[20]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioA[19]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioA[18]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioA[17]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioA[16]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioA[15]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioA[14]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioA[13]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioA[12]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioA[11]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioA[10]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioA[9]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioA[8]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioA[7]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioA[6]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioA[5]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioA[4]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioA[3]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioA[2]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioA[1]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioA[0]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioB[31]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioB[30]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioB[29]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioB[28]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioB[27]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioB[26]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioB[25]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioB[24]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioB[23]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioB[22]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioB[21]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioB[20]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioB[19]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioB[18]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioB[17]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioB[16]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioB[15]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioB[14]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioB[13]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioB[12]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioB[11]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioB[10]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioB[9]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioB[8]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioB[7]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioB[6]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioB[5]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioB[4]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioB[3]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioB[2]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioB[1]}]
set_input_delay -clock hfextclk  3  [get_ports {io_pads_gpioB[0]}]
set_input_delay -clock hfextclk  3  [get_ports io_pads_qspi0_dq_0]
set_input_delay -clock hfextclk  3  [get_ports io_pads_qspi0_dq_1]
set_input_delay -clock hfextclk  3  [get_ports io_pads_qspi0_dq_2]
set_input_delay -clock hfextclk  3  [get_ports io_pads_qspi0_dq_3]
set_input_delay -clock lfextclk  3  [get_ports io_pads_dbgmode0_n_i_ival]
set_input_delay -clock lfextclk  3  [get_ports io_pads_dbgmode1_n_i_ival]
set_input_delay -clock lfextclk  3  [get_ports io_pads_dbgmode2_n_i_ival]
set_input_delay -clock lfextclk  3  [get_ports io_pads_bootrom_n_i_ival]
set_input_delay -clock lfextclk  3  [get_ports io_pads_aon_pmu_dwakeup_n_i_ival]
set_input_delay -clock hfextclk  3  [get_ports test_mode]
set_input_delay -clock lfextclk  3  -add_delay  [get_ports test_mode]
set_output_delay -clock hfextclk  3  [get_ports hfxoscen]
set_output_delay -clock lfextclk  3  [get_ports lfxoscen]
set_output_delay -clock JTAG_CLK  3  [get_ports io_pads_jtag_TDO_o]
set_output_delay -clock hfextclk  3  [get_ports io_pads_qspi0_sck_o_oval]
set_output_delay -clock hfextclk  3  [get_ports io_pads_qspi0_cs_0_o_oval]
set_output_delay -clock lfextclk  3  [get_ports io_pads_aon_pmu_padrst_o_oval]
set_output_delay -clock lfextclk  3  [get_ports io_pads_aon_pmu_vddpaden_o_oval]
set_input_transition -max 0.5  [get_ports hfextclk]
set_input_transition -min 0.5  [get_ports hfextclk]
set_input_transition -max 0.5  [get_ports lfextclk]
set_input_transition -min 0.5  [get_ports lfextclk]
set_input_transition -max 0.5  [get_ports io_pads_jtag_TCK_i_ival]
set_input_transition -min 0.5  [get_ports io_pads_jtag_TCK_i_ival]
set_input_transition -max 0.5  [get_ports io_pads_jtag_TMS_i_ival]
set_input_transition -min 0.5  [get_ports io_pads_jtag_TMS_i_ival]
set_input_transition -max 0.5  [get_ports io_pads_jtag_TDI_i_ival]
set_input_transition -min 0.5  [get_ports io_pads_jtag_TDI_i_ival]
set_input_transition -max 0.5  [get_ports {io_pads_gpioA[31]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioA[31]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioA[30]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioA[30]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioA[29]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioA[29]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioA[28]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioA[28]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioA[27]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioA[27]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioA[26]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioA[26]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioA[25]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioA[25]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioA[24]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioA[24]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioA[23]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioA[23]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioA[22]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioA[22]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioA[21]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioA[21]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioA[20]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioA[20]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioA[19]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioA[19]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioA[18]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioA[18]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioA[17]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioA[17]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioA[16]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioA[16]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioA[15]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioA[15]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioA[14]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioA[14]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioA[13]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioA[13]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioA[12]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioA[12]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioA[11]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioA[11]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioA[10]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioA[10]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioA[9]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioA[9]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioA[8]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioA[8]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioA[7]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioA[7]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioA[6]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioA[6]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioA[5]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioA[5]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioA[4]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioA[4]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioA[3]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioA[3]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioA[2]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioA[2]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioA[1]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioA[1]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioA[0]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioA[0]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioB[31]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioB[31]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioB[30]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioB[30]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioB[29]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioB[29]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioB[28]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioB[28]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioB[27]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioB[27]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioB[26]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioB[26]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioB[25]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioB[25]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioB[24]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioB[24]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioB[23]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioB[23]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioB[22]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioB[22]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioB[21]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioB[21]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioB[20]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioB[20]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioB[19]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioB[19]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioB[18]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioB[18]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioB[17]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioB[17]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioB[16]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioB[16]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioB[15]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioB[15]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioB[14]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioB[14]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioB[13]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioB[13]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioB[12]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioB[12]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioB[11]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioB[11]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioB[10]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioB[10]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioB[9]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioB[9]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioB[8]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioB[8]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioB[7]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioB[7]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioB[6]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioB[6]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioB[5]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioB[5]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioB[4]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioB[4]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioB[3]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioB[3]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioB[2]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioB[2]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioB[1]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioB[1]}]
set_input_transition -max 0.5  [get_ports {io_pads_gpioB[0]}]
set_input_transition -min 0.5  [get_ports {io_pads_gpioB[0]}]
set_input_transition -max 0.5  [get_ports io_pads_qspi0_dq_0]
set_input_transition -min 0.5  [get_ports io_pads_qspi0_dq_0]
set_input_transition -max 0.5  [get_ports io_pads_qspi0_dq_1]
set_input_transition -min 0.5  [get_ports io_pads_qspi0_dq_1]
set_input_transition -max 0.5  [get_ports io_pads_qspi0_dq_2]
set_input_transition -min 0.5  [get_ports io_pads_qspi0_dq_2]
set_input_transition -max 0.5  [get_ports io_pads_qspi0_dq_3]
set_input_transition -min 0.5  [get_ports io_pads_qspi0_dq_3]
set_input_transition -max 0.5  [get_ports io_pads_aon_erst_n_i_ival]
set_input_transition -min 0.5  [get_ports io_pads_aon_erst_n_i_ival]
set_input_transition -max 0.5  [get_ports io_pads_dbgmode0_n_i_ival]
set_input_transition -min 0.5  [get_ports io_pads_dbgmode0_n_i_ival]
set_input_transition -max 0.5  [get_ports io_pads_dbgmode1_n_i_ival]
set_input_transition -min 0.5  [get_ports io_pads_dbgmode1_n_i_ival]
set_input_transition -max 0.5  [get_ports io_pads_dbgmode2_n_i_ival]
set_input_transition -min 0.5  [get_ports io_pads_dbgmode2_n_i_ival]
set_input_transition -max 0.5  [get_ports io_pads_bootrom_n_i_ival]
set_input_transition -min 0.5  [get_ports io_pads_bootrom_n_i_ival]
set_input_transition -max 0.5  [get_ports io_pads_aon_pmu_dwakeup_n_i_ival]
set_input_transition -min 0.5  [get_ports io_pads_aon_pmu_dwakeup_n_i_ival]
set_input_transition -max 0.5  [get_ports test_mode]
set_input_transition -min 0.5  [get_ports test_mode]
